cmsis-svd/cmsis-svd/data/Holtek/HT32F1653_54.svd
        <!--GPIOC_SRR-->
        <register>
          <name>GPIOC_SRR</name>
          <displayName>GPIOC_SRR</displayName>
          <description>GPIOC_SRR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SET0</name>
              <description>SET0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET1</name>
              <description>SET1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET2</name>
              <description>SET2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET3</name>
              <description>SET3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET4</name>
              <description>SET4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET5</name>
              <description>SET5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET6</name>
              <description>SET6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET7</name>
              <description>SET7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET8</name>
              <description>SET8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET9</name>
              <description>SET9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET10</name>
              <description>SET10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET11</name>
              <description>SET11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET12</name>
              <description>SET12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET13</name>
              <description>SET13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET14</name>
              <description>SET14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SET15</name>
              <description>SET15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST0</name>
              <description>RST0</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST1</name>
              <description>RST1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST2</name>
              <description>RST2</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST3</name>
              <description>RST3</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST4</name>
              <description>RST4</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST5</name>
              <description>RST5</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST6</name>
              <description>RST6</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST7</name>
              <description>RST7</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST8</name>
              <description>RST8</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST9</name>
              <description>RST9</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST10</name>
              <description>RST10</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST11</name>
              <description>RST11</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST12</name>
              <description>RST12</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST13</name>
              <description>RST13</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST14</name>
              <description>RST14</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST15</name>
              <description>RST15</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--GPIOC_RR-->
        <register>
          <name>GPIOC_RR</name>
          <displayName>GPIOC_RR</displayName>
          <description>GPIOC_RR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RST0</name>
              <description>RST0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST1</name>
              <description>RST1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST2</name>
              <description>RST2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST3</name>
              <description>RST3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST4</name>
              <description>RST4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST5</name>
              <description>RST5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST6</name>
              <description>RST6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST7</name>
              <description>RST7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST8</name>
              <description>RST8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST9</name>
              <description>RST9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST10</name>
              <description>RST10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST11</name>
              <description>RST11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST12</name>
              <description>RST12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST13</name>
              <description>RST13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST14</name>
              <description>RST14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RST15</name>
              <description>RST15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
