cmsis-svd/cmsis-svd/data/Holtek/HT32F1653_54.svd
        <!--ADC_HLST-->
        <register>
          <name>ADC_HLST</name>
          <displayName>ADC_HLST</displayName>
          <description>ADC_HLST</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADHSEQ0</name>
              <description>ADHSEQ0</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADHSEQ1</name>
              <description>ADHSEQ1</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADHSEQ2</name>
              <description>ADHSEQ2</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADHSEQ3</name>
              <description>ADHSEQ3</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_OFR0-->
        <register>
          <name>ADC_OFR0</name>
          <displayName>ADC_OFR0</displayName>
          <description>ADC_OFR0</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADOF0</name>
              <description>ADOF0</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADAL0</name>
              <description>ADAL0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADOFE0</name>
              <description>ADOFE0</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_OFR1-->
        <register>
          <name>ADC_OFR1</name>
          <displayName>ADC_OFR1</displayName>
          <description>ADC_OFR1</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADOF1</name>
              <description>ADOF1</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADAL1</name>
              <description>ADAL1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADOFE1</name>
              <description>ADOFE1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_OFR2-->
        <register>
          <name>ADC_OFR2</name>
          <displayName>ADC_OFR2</displayName>
          <description>ADC_OFR2</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADOF2</name>
              <description>ADOF2</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADAL2</name>
              <description>ADAL2</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADOFE2</name>
              <description>ADOFE2</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_OFR3-->
        <register>
          <name>ADC_OFR3</name>
          <displayName>ADC_OFR3</displayName>
          <description>ADC_OFR3</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADOF3</name>
              <description>ADOF3</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADAL3</name>
              <description>ADAL3</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADOFE3</name>
              <description>ADOFE3</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_OFR4-->
        <register>
          <name>ADC_OFR4</name>
          <displayName>ADC_OFR4</displayName>
          <description>ADC_OFR4</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADOF4</name>
              <description>ADOF4</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADAL4</name>
              <description>ADAL4</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADOFE4</name>
              <description>ADOFE4</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_OFR5-->
        <register>
          <name>ADC_OFR5</name>
          <displayName>ADC_OFR5</displayName>
          <description>ADC_OFR5</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADOF5</name>
              <description>ADOF5</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADAL5</name>
              <description>ADAL5</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADOFE5</name>
              <description>ADOFE5</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
