cmsis-svd/cmsis-svd/data/Holtek/HT32F1653_54.svd
      </registers>
    </peripheral>
    <!--UART0-->
    <peripheral>
      <name>UART0</name>
      <version>1.1</version>
      <description>UART0</description>
      <groupName>UART</groupName>
      <baseAddress>0x40001000</baseAddress>
      <size>32</size><!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size><!--Bytes-->
        <usage>registers</usage><!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>UART0</name>
        <value>49</value>
      </interrupt>
      <registers>
        <!--UART0_RBR-->
        <register>
          <name>UART0_RBR</name>
          <displayName>UART0_RBR</displayName>
          <description>UART0_RBR</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RD</name>
              <description>RD</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_TBR-->
        <register>
          <name>UART0_TBR</name>
          <displayName>UART0_TBR</displayName>
          <description>UART0_TBR</description>
          <alternateGroup>UART0</alternateGroup>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TD</name>
              <description>TD</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_IER-->
        <register>
          <name>UART0_IER</name>
          <displayName>UART0_IER</displayName>
          <description>UART0_IER</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RFTLI_RTOIE</name>
              <description>RFTLI_RTOIE</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TFTLIE</name>
              <description>TFTLIE</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RLSIE</name>
              <description>RLSIE</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_IIR-->
        <register>
          <name>UART0_IIR</name>
          <displayName>UART0_IIR</displayName>
          <description>UART0_IIR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>NIP</name>
              <description>NIP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>IID</name>
              <description>IID</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_FCR-->
        <register>
          <name>UART0_FCR</name>
          <displayName>UART0_FCR</displayName>
          <description>UART0_FCR</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>FME</name>
              <description>FME</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RFR</name>
              <description>RFR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TFR</name>
              <description>TFR</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TFTL</name>
              <description>TFTL</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RFTL</name>
              <description>RFTL</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>URTXEN</name>
              <description>URTXEN</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>URRXEN</name>
              <description>URRXEN</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_LCR-->
        <register>
          <name>UART0_LCR</name>
          <displayName>UART0_LCR</displayName>
          <description>UART0_LCR</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WLS</name>
              <description>WLS</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>NSB</name>
              <description>NSB</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBE</name>
              <description>PBE</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EPE</name>
              <description>EPE</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SPE</name>
              <description>SPE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BCB</name>
              <description>BCB</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_LSR-->
        <register>
          <name>UART0_LSR</name>
          <displayName>UART0_LSR</displayName>
          <description>UART0_LSR</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RFDR</name>
              <description>RFDR</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>OEI</name>
              <description>OEI</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PEI</name>
              <description>PEI</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>FEI</name>
              <description>FEI</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BII</name>
              <description>BII</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TXFEMPT</name>
              <description>TXFEMPT</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TXEMPT</name>
              <description>TXEMPT</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ERRRX</name>
              <description>ERRRX</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_TPR-->
        <register>
          <name>UART0_TPR</name>
          <displayName>UART0_TPR</displayName>
          <description>UART0_TPR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RTOIC</name>
              <description>RTOIC</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RTOIE</name>
              <description>RTOIE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TG</name>
              <description>TG</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_MDR-->
        <register>
          <name>UART0_MDR</name>
          <displayName>UART0_MDR</displayName>
          <description>UART0_MDR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TRSM</name>
              <description>TRSM</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>TXDMAEN</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>RXDMAEN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_FSR-->
        <register>
          <name>UART0_FSR</name>
          <displayName>UART0_FSR</displayName>
          <description>UART0_FSR</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>TXFS</name>
              <description>TXFS</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RXFS</name>
              <description>RXFS</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_DLR-->
        <register>
          <name>UART0_DLR</name>
          <displayName>UART0_DLR</displayName>
          <description>UART0_DLR</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BRD</name>
              <description>BRD</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--UART0_DEGTSTR-->
        <register>
          <name>UART0_DEGTSTR</name>
          <displayName>UART0_DEGTSTR</displayName>
          <description>UART0_DEGTSTR</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>LBM</name>
              <description>LBM</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
