cmsis-svd/cmsis-svd/data/Holtek/HT32F1653_54.svd
        <!--EBI_SR-->
        <register>
          <name>EBI_SR</name>
          <displayName>EBI_SR</displayName>
          <description>EBI_SR</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>EBIBUSY</name>
              <description>EBIBUSY</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EBIARDY</name>
              <description>EBIARDY</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EBISMRST</name>
              <description>EBISMRST</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_ATR0-->
        <register>
          <name>EBI_ATR0</name>
          <displayName>EBI_ATR0</displayName>
          <description>EBI_ATR0</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>ADDRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>ADDRHOLD</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_ATR1-->
        <register>
          <name>EBI_ATR1</name>
          <displayName>EBI_ATR1</displayName>
          <description>EBI_ATR1</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>ADDRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>ADDRHOLD</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_ATR2-->
        <register>
          <name>EBI_ATR2</name>
          <displayName>EBI_ATR2</displayName>
          <description>EBI_ATR2</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>ADDRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>ADDRHOLD</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_ATR3-->
        <register>
          <name>EBI_ATR3</name>
          <displayName>EBI_ATR3</displayName>
          <description>EBI_ATR3</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADDRSETUP</name>
              <description>ADDRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADDRHOLD</name>
              <description>ADDRHOLD</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_RTR0-->
        <register>
          <name>EBI_RTR0</name>
          <displayName>EBI_RTR0</displayName>
          <description>EBI_RTR0</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>RDSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDSTRB</name>
              <description>RDSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PGEN</name>
              <description>PGEN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
