cmsis-svd/cmsis-svd/data/Holtek/HT32F1653_54.svd
        <!--EBI_RTR1-->
        <register>
          <name>EBI_RTR1</name>
          <displayName>EBI_RTR1</displayName>
          <description>EBI_RTR1</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>RDSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDSTRB</name>
              <description>RDSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PGEN</name>
              <description>PGEN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_RTR2-->
        <register>
          <name>EBI_RTR2</name>
          <displayName>EBI_RTR2</displayName>
          <description>EBI_RTR2</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>RDSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDSTRB</name>
              <description>RDSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PGEN</name>
              <description>PGEN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_RTR3-->
        <register>
          <name>EBI_RTR3</name>
          <displayName>EBI_RTR3</displayName>
          <description>EBI_RTR3</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>RDSETUP</name>
              <description>RDSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDSTRB</name>
              <description>RDSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PGEN</name>
              <description>PGEN</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_WTR0-->
        <register>
          <name>EBI_WTR0</name>
          <displayName>EBI_WTR0</displayName>
          <description>EBI_WTR0</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>WRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WRSTRB</name>
              <description>WRSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WRHOLD</name>
              <description>WRHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_WTR1-->
        <register>
          <name>EBI_WTR1</name>
          <displayName>EBI_WTR1</displayName>
          <description>EBI_WTR1</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>WRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WRSTRB</name>
              <description>WRSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WRHOLD</name>
              <description>WRHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EBI_WTR2-->
        <register>
          <name>EBI_WTR2</name>
          <displayName>EBI_WTR2</displayName>
          <description>EBI_WTR2</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>WRSETUP</name>
              <description>WRSETUP</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WRSTRB</name>
              <description>WRSTRB</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>WRHOLD</name>
              <description>WRHOLD</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
